CSI API ETABS v1
cFrameObj.GetTypeOAPI Method
 Retrieves the type of frame object (straight or curved)
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTypeOAPI(
	string Name,
	ref string MyType
)
Function GetTypeOAPI (
	Name As String,
	ByRef MyType As String
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim MyType As String
Dim returnValue As Integer
returnValue = instance.GetTypeOAPI(Name,
	MyType)
int GetTypeOAPI(
	String^ Name,
	String^% MyType
)
abstract GetTypeOAPI :
        Name : string *
        MyType : string byref -> int
Parameters
Name
Type: System.String
 The name of a defined frame object
MyType
Type: System.String
 This is "Straight" or "Curved", indicating the type of frame object
Return Value
Type: Int32
 Returns zero if the frame object type is successfully retrieved, otherwise it returns a nonzero value
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim MyType  As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'get frame type
   ret = SapModel.FrameObj.GetTypeOAPI("3", MyType)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace